getSongIndex(dayNo, songNo) {
  if (dayNo == 0 && songNo <= 0) {
    return 0;
  } else if (songNo > songIndex[dayNo - 1].length) {
    return songIndex[dayNo - 1][songIndex[dayNo - 1].length - 1];
  } else {
    return songIndex[dayNo - 1][songNo - 1];
  }
}

var tamilLyric = [];

//   """[00:00.00]அருணாசல மஹாத்மியம்
// [00:00.05]கருணார் ணவமாய்க் கருதக் கதிநல்கும்
// [00:07.00]அருணாசல சிவமீதாம்
// [00:12.50]
// [00:13.00]அருணாசல தத்துவம்
// [00:13.00]புத்தியகங் காரம் புலம்பெய்த வோங்கு
// [00:20.00]மத்தியித யந்தான் மறையவனு மாலு
// [00:25.00]நத்தவறி யாது நலங்குலைய வன்னார்
// [00:31.00]மத்தியொளி ரண்ணா மலையினது மெய்யே.
// [00:36.20]
// [00:36.50]தீபதர்சன தத்துவம்
// [00:36.50]இத்தனுவே நானா மெனுமதியை நீத்தப்
// [00:43.30]புத்தியித யத்தே பொருந்தியக நோக்கா
// [00:49.00]லத்துவித மாமெய் யகச்சுடர்காண் கைபூ
// [00:54.80]மத்தியெனு மண்ணா மலைச்சுடர்காண் மெய்யே.
// [01:00.50]
// [01:00.50]நந்திவாக்கு:-
// [01:00.50](விருத்தம்)
// [01:00.50]
// [01:00.50]அதுவேதல மருணாசலந் தலம்யாவிலு மதிக
// [01:11.00]மதுபூமியி னிதயம்மறி யதுவேசிவ னிதயப்
// [01:20.00]பதியாமொரு மருமத்தலம் பதியாமவ னதிலே
// [01:29.80]வதிவானொளி மலையாநித மருணாசல மெனவே.
// [01:39.70]                                    (1)
// [01:39.70]
// [01:39.70]ஆதியரு ணாசலப்பே ரற்புதலிங் கத்துருக்கொ
// [01:47.00]ளாதிநாண் மார்கழியி லாதிரையச்  சோதியெழு
// [01:54.00]மீசனைமான் முன்னமர ரேத்திவழி பட்டநாண்
// [02:00.00]மாசிசிவ ராத்திரியா மற்று.
// [02:06.00]                                     (2)
// [02:06.00]
// [02:06.00]அங்கியுரு வாயுமொளி மங்குகிரி யாகத்
// [02:11.00]தங்கலரு ளாலுலகந் தாங்குவதற் கன்றி
// [02:18.00]யிங்குறைவன் சித்தனென வென்றுமென துள்ளே
// [02:23.00]பொங்கியொளி ருங்குகைபல் போகமொடென் றுள்ளே.
// [02:31.00]                                     (3)
// [02:31.00]
// [02:31.00]எல்லா வுலகுந் தகையவ் வியலாற்
// [02:36.00]பொல்லா வினைகள் ருணமாம் புகலீ
// [02:42.00]தில்லா ததுவா மெதுகண் ணுறலா
// [02:46.80]லெல்லா ரருணா சலமா மிதுவே.
// [02:54.00]                                     (4)
// [02:54.00]
// [02:54.00]உருத்தெரி யெல்லை யுற்றுகண் ணுற்றாற்
// [02:59.00]கருத்தினாற் றூரக் கருதினா லும்மே
// [03:04.00]வருத்த முறாது வராதவே தாந்த
// [03:09.50]வருத்தவிஞ் ஞான மார்க்குமுண் டாமே.
// [03:16.00]                                     (5)
// [03:16.00]
// [03:16.00]யோசனை மூன்றா மித்தல வாசர்க்
// [03:21.00]காசறு தீக்கை யாதியின் றியுமென்
// [03:26.00]பாசமில் சாயுச் சியம்பயக் கும்மே
// [03:31.00]யீசனா மென்ற னாணையி னானே.
// [03:37.00]                                     (6)
// [03:37.00]
// [03:37.00]என்றுமே யறவோ ரன்பர்க் கிருப்பிட மித்த லந்தான்
// [03:44.00]பொன்றுவார் பிறர்க்கின் னாவுன் புன்மையர் பன்னோய் துன்னி
// [03:51.30]யொன்றுறா தொழியுந் தீயோ ருரனொரு கணத்திங் கங்கிக்
// [03:58.00]குன்றுரு வருணை யீசன் கோபவெந் தழல்வி ழாதே.
// [04:07.50]                                     (7)""",
//   """
// [00:00.00]தருணா ருணமணி கிரணா வலிநிகர்
// [00:06.00]தரும க்ஷரமண மகிழ்மாலை
// [00:12.00]தெருணா டியதிரு வடியார் தெருமரல்
// [00:17.00]தெளியப் பரவுதல் பொருளாகக்
// [00:24.00]கருணா கரமுனி ரமணா ரியனுவ
// [00:30.00]கையினாற் சொலியது கதியாக
// [00:35.00]வருணா சலமென வகமே யறிவொடு
// [00:41.00]மாழ்வார் சிவனுல காள்வாரே.
// [00:47.00]அருணாசல வரற்கேற்ற
// [00:52.00]வக்ஷரமண மாலைசாற்றக்
// [00:57.00]கருணாகர கணபதியே
// [01:02.00]கரமருளிக் காப்பாயே.
// [01:01.00]அருணா சலசிவ அருணா சலசிவ
// [01:01.00]அருணா சலசிவ அருணாசலா!
// [01:01.00]அருணா சலசிவ அருணா சலசிவ
// [01:01.00]அருணா சலசிவ அருணாசலா!
// [01:33.00]அருணா சலமென வகமே நினைப்பவ
// [01:38.00]ரகத்தைவே ரறுப்பா யருணாசலா (அ)
// [01:44.00]அழகுசுந் தரம்போ லகமும் நீயுமுற்
// [01:49.00]றபின்னமா யிருப்போ மருணாசலா(அ)
// [01:55.00]அகம்புகுந் தீர்த்துன் னககுகை சிறையா
// [01:59.00]யமர்வித்த தென்கொ லருணாசலா(அ)
// [02:05.00]ஆருக் காவெனை யாண்டனை யகற்றிடி
// [02:10.00]லகிலம் பழித்திடு மருணாசலா(அ)
// [02:16.00]இப்பழி தப்புனை யேனினைப் பித்தா
// [02:21.00]யினியார் விடுவா ரருணாசலா(அ)
// [02:26.00]ஈன்றிடு மன்னையிற் பெரிதருள் புரிவோ
// [02:32.00]யிதுவோ வுனதரு ளருணாசலா(அ)
// [02:37.00]உனையே மாற்றி யோடா துளத்தின்மே
// [02:42.00]லுறுதியா யிருப்பா யருணாசலா(அ)
// [02:48.00]ஊர்சுற் றுளம்விடா துனைக்கண் டடங்கிட
// [02:53.00]வுன்னழ கைக்காட் டருணாசலா(அ)
// [02:58.00]எனையழித் திப்போ தெனைக்கல வாவிடி
// [03:03.00]லிதுவோ வாண்மை யருணாசலா(அ)
// [03:09.00]ஏனிந்த வுறக்க மெனைப்பிற ரிழுக்க
// [03:14.00]விதுவுனக் கழகோ வருணாசலா(அ)
// [03:20.00]ஐம்புலக் கள்வ ரகத்தினிற் புகும்போ
// [03:24.00]தகத்தினீ யிலையோ வருணாசலா(அ)
// [03:30.00]ஒருவனா முன்னை யொளித்தெவர் வருவா
// [03:36.00]ருன்சூ தேயிது வருணாசலா(அ)
// [03:41.00]ஓங்கா ரப்பொரு ளொப்புயர் வில்லோ
// [03:46.00]யுனையா ரறிவா ரருணாசலா(அ)
// [03:51.00]ஒளவைபோ லெனக்குன் னருளைத் தந்தெனை
// [03:56.00]யாளுவ துன்கட னருணாசலா(அ)
// [04:02.00]கண்ணுக்குக் கண்ணாய்க் கண்ணின்றிக் காணுனைக்
// [04:07.00]காணுவ தெவர்பா ரருணாசலா(அ)
// [04:12.00]காந்த மிரும்புபோற் கவர்ந்தெனை விடாமற்
// [04:17.00]கலந்தெனோ டிருப்பா யருணாசலா(அ)
// [04:22.00]கிரியுரு வாகிய கிருபைக் கடலே
// [04:27.00]கிருபைகூர்ந் தருளுவா யருணாசலா(அ)
// [04:32.00]கீழ்மே லெங்குங் கிளரொளி மணியென்
// [04:38.00]கீழ்மையைப் பாழ்செய் யருணாசலா(அ)
// [04:43.00]குற்றமுற் றறுத்தெனைக் குணமாய்ப் பணித்தாள்
// [04:48.00]குருவுரு வாயொளி ரருணாசலா(அ)
// [04:53.00]கூர்வாட் கண்ணியர் கொடுமையிற் படாதருள்
// [04:58.00]கூர்ந்தெனைச் சேர்ந்தரு ளருணாசலா(அ)
// [05:03.00]கெஞ்சியும் வஞ்சியாய்க் கொஞ்சமு மிரங்கிலை
// [05:08.00]யஞ்சலென் றேயரு ளருணாசலா(அ)
// [05:14.00]கேளா தளிக்குமுன் கேடில் புகழைக்
// [05:19.00]கேடுசெய் யாதரு ளருணாசலா(அ)
// [05:24.00]கையினிற் கனியுன் மெய்ரசங் கொண்டுவ
// [05:31.00]கைவெறி கொளவரு ளருணாசலா(அ)
// [05:35.00]கொடியிட் டடியரைக் கொல்லுனைக் கட்டிக்
// [05:40.00]கொண்டெஙன் வாழ்வே னருணாசலா(அ)
// [05:45.00]கோபமில் குணத்தோய் குறியா யெனைக்கொளக்
// [05:51.00]குறையென் செய்தே னருணாசலா(அ)
// [05:56.00]கௌதமர் போற்றுங் கருணைமா மலையே
// [06:01.00]கடைக்கணித் தாள்வா யருணாசலா(அ)
// [06:06.00]சகலமும் விழுங்குங் கதிரொளி யினமன
// [06:11.00]சலச மலர்த்தியி டருணாசலா(அ)
// [06:16.00]சாப்பா டுன்னைச் சார்ந்துண வாயான்
// [06:21.00]சாந்தமாய்ப் போவ னருணாசலா(அ)
// [06:26.00]சித்தங் குளிரக்கதி ரத்தம்வைத் தமுதவா
// [06:32.00]யைத்திற வருண்மதி யருணாசலா(அ)
// [06:36.00]சீரை யழித்துநிர் வாணமாச் செய்தருட்
// [06:41.00]சீரை யளித்தரு ளருணாசலா(அ)
// [06:47.00]சுகக்கடல் பொங்கச் சொல்லுணர் வடங்கச்
// [06:52.00]சும்மா பொருந்திடங் கருணாசலா(அ)
// [06:57.00]சூதுசெய் தென்னைச் சோதியா தினியுன்
// [07:02.00]சோதி யுருக்காட் டருணாசலா(அ)
// [07:07.00]செப்படி வித்தைகற் றிப்படி மயக்குவிட்
// [07:12.00]டுருப்படு வித்தைகாட் டருணாசலா(அ)
// [07:17.00]சேரா யெனின்மெய் நீரா யுருகிக்கண்
// [07:22.00]ணீராற் றழிவே னருணாசலா(அ)
// [07:27.00]சையெனத் தள்ளிற் செய்வினை சுடுமலா
// [07:32.00]லுய்வகை யேதுரை யருணாசலா(அ)
// [07:37.00]சொல்லாது சொலிநீ சொல்லற நில்லென்று
// [07:43.00]சும்மா விருந்தா யருணாசலா(அ)
// [07:47.00]சோம்பியாய்ச் சும்மா சுகமுண் டுறங்கிடிற்
// [07:53.00]சொல்வே றென்கதி யருணாசலா(அ)
// [07:57.00]சௌரியங் காட்டினை சழக்கற்ற தென்றே
// [08:03.00]சலியா திருந்தா யருணாசலா(அ)
// [08:08.00]ஞமலியிற் கேடா நானென் னுறுதியா
// [08:12.00]னாடிநின் னுறுவே னருணாசலா(அ)
// [08:18.00]ஞானமில் லாதுன் னாசையாற் றளர்வற
// [08:23.00]ஞானந் தெரித்தரு ளருணாசலா(அ)
// [08:28.00]ஞிமிறுபோ னீயு மலர்ந்திலை யென்றே
// [08:33.00]நேர்நின் றனையென் னருணாசலா(அ)
// [08:38.00].தத்துவந் தெரியா தத்தனை யுற்றாய்
// [08:43.00]தத்துவ மிதுவென் னருணாசலா(அ)
// [08:48.00]தானே தானே தத்துவ மிதனைத்
// [08:53.00]தானே காட்டுவா யருணாசலா(அ)
// [08:58.00]திரும்பி யகந்தனைத் தினமகக் கண்காண்
// [09:03.00]டெரியுமென் றனையென் னருணாசலா(அ)
// [09:08.00]தீரமி லகத்திற் றேடியுந் தனையான்
// [09:13.00]றிரும்பவுற் றேனரு ளருணாசலா(அ)
// [09:19.00]துப்பறி வில்லா விப்பிறப் பென்பய
// [09:23.00]னொப்பிட வாயே னருணாசலா(அ)
// [09:28.00]தூய்மன மொழியர் தோயுமுன் மெய்யகந்
// [09:33.00]தோயவே யருளென் னருணாசலா(அ)
// [09:38.00]தெய்வமென் றுன்னைச் சாரவே யென்னைச்
// [09:43.00]சேர வொழித்தா யருணாசலா(அ)
// [09:48.00]தேடா துற்றநற் றிருவரு ணிதியகத்
// [09:53.00]தியக்கந் தீர்த்தரு ளருணாசலா(அ)
// [09:58.00]தைரிய மோடுமுன் மெய்யக நாடயான்
// [10:03.00]றட்டழிந் தேனரு ளருணாசலா(அ)
// [10:08.00]தொட்டருட் கைமெய் கட்டிடா யெனிலியா
// [10:13.00]னட்டமா வேனரு ளருணாசலா(அ)
// [10:18.00]தோடமி னீயகத் தோடொன்றி யென்றுஞ்சந்
// [10:23.00]தோடமொன் றிடவரு ளருணாசலா(அ)
// [10:28.00]நகைக்கிட மிலைநின் னாடிய வெனையரு
// [10:32.00]ணகையிட்டுப் பார்நீ யருணாசலா(அ)
// [10:38.00]நாணிலை நாடிட நானா யொன்றிநீ
// [10:43.00]தாணுவா நின்றனை யருணாசலா(அ)
// [10:48.00]நின்னெரி யெரித்தெனை நீறாக் கிடுமுன்
// [10:53.00]னின்னருண் மழைபொழி யருணாசலா(அ)
// [10:58.00]நீநா னறப்புலி நிதங்களி மயமா
// [11:03.00]நின்றிடு நிலையரு ளருணாசலா(அ)
// [11:08.00]நுண்ணுரு வுனையான் விண்ணுரு நண்ணிட
// [11:13.00]வெண்ணலை யிறுமென் றருணாசலா(அ)
// [11:18.00]நூலறி வறியாப் பேதைய னென்றன்
// [11:23.00]மாலறி வறுத்தரு ளருணாசலா(அ)
// [11:27.00]நெக்குநெக் குருகியான் புக்கிட வுனைப்புக
// [11:32.00]னக்கனா நின்றனை யருணாசலா(அ)
// [11:37.00]நேசமி லெனக்குன் னாசையைக் காட்டிநீ
// [11:42.00]மோசஞ் செயாதரு ளருணாசலா(அ)
// [11:47.00]நைந்தழி கனியா னலனிலை பதத்தி
// [11:52.00]னாடியுட் கொள்நல மருணாசலா(அ)
// [11:57.00]நொந்திடா துன்றனைத் தந்தெனைக் கொண்டிலை
// [12:03.00]யந்தக னீயெனக் கருணாசலா(அ)
// [12:07.00]நோக்கியே கருதிமெய் தாக்கியே பக்குவ
// [12:12.00]மாக்கிநீ யாண்டரு ளருணாசலா(அ)
// [12:17.00]பற்றிமால் விடந்தலை யுற்றிறு முனமருள்
// [12:22.00]பற்றிட வருள்புரி யருணாசலா(அ)
// [12:27.00]பார்த்தருண் மாலறப் பார்த்திலை யெனினருள்
// [12:32.00]பாருனக் கார்சொல்வ ரருணாசலா(அ)
// [12:37.00]பித்துவிட் டுனைநேர் பித்தனாக் கினையருள்
// [12:41.00]பித்தந் தெளிமருந் தருணாசலா(அ)
// [12:47.00]பீதியி லுனைச்சார் பீதியி லெனைச்சேர்
// [12:51.00]பீதியுன் றனக்கே னருணாசலா(அ)
// [12:56.00]புல்லறி வேதுரை நல்லறி வேதுரை
// [13:01.00]புல்லிட வேயரு ளருணாசலா(அ)
// [13:07.00]பூமண மாமனம் பூரண மணங்கொளப்
// [13:12.00]பூரண மணமரு ளருணாசலா(அ)
// [13:17.00]பெயர்நினைத் திடவே பிடித்திழுத் தனையுன்
// [13:22.00]பெருமையா ரறிவா ரருணாசலா(அ)
// [13:26.00]பேய்த்தனம் விடவிடாப் பேயாப் பிடித்தெனைப்
// [13:31.00]பேயனாக் கினையென் னருணாசலா(அ)
// [13:36.00]பைங்கொடி யாநான் பற்றின்றி வாடாமற்
// [13:41.00]பற்றுக்கோ டாய்க்கா வருணாசலா(அ)
// [13:46.00]பொடியான் மயக்கியென் போதத்தைப் பறித்துன்
// [13:52.00]போதத்தைக் காட்டினை யருணாசலா(அ)
// [13:56.00]போக்கும் வரவுமில் பொதுவெளி யினிலருட்
// [14:01.00]போராட் டங்காட் டருணாசலா(அ)
// [14:06.00]பௌதிக மாமுடற் பற்றற்று நாளுமுன்
// [14:11.00]பவிசுகண் டுறவரு ளருணாசலா(அ)
// [14:16.00]மலைமருந் திடநீ மலைத்திட வோவருண்
// [14:21.00]மலைமருந் தாயொளி ரருணாசலா(அ)
// [14:26.00]மானங்கொண் டுறுபவர் மானத்தை யழித்தபி
// [14:31.00]மானமில் லாதொளி ரருணாசலா(அ)
// [14:36.00]மிஞ்சிடிற் கெஞ்சிடுங் கொஞ்ச வறிவனியான்
// [14:41.00]வஞ்சியா தருளெனை யருணாசலா(அ)
// [14:46.00]மீகாம னில்லாமன் மாகாற் றலைகல
// [14:51.00]மாகாமற் காத்தரு ளருணாசலா(அ)
// [14:56.00]முடியடி காணா முடிவிடுத் தனைநேர்
// [15:01.00]முடிவிடக் கடனிலை யருணாசலா(அ)
// [15:06.00]மூக்கிலன் முன்காட்டு முகுரமா காதெனைத்
// [15:10.00]தூக்கி யணைந்தரு ளருணாசலா(அ)
// [15:16.00]மெய்யகத் தின்மன மென்மல ரணையினா
// [15:21.00]மெய்கலந் திடவரு ளருணாசலா(அ)
// [15:26.00]மேன்மேற் றாழ்ந்திடு மெல்லியர்ச் சேர்ந்துநீ
// [15:31.00]மேன்மையுற் றனையென் னருணாசலா(அ)
// [15:36.00]மைமய னீத்தருண் மையினா லுனதுண்
// [15:41.00]மைவச மாக்கினை யருணாசலா(அ)
// [15:45.00]மொட்டை யடித்தெனை வெட்ட வெளியினீ
// [15:50.00]நட்டமா டினையென் னருணாசலா(அ)
// [15:55.00]மோகந் தவிர்த்துன் மோகமா வைத்துமென்
// [16:00.00]மோகந்தீ ராயென் னருணாசலா(அ)
// [16:05.00]மௌனியாய்க் கற்போன் மலரா திருந்தான்
// [16:10.00]மௌனமி தாமோ வருணாசலா(அ)
// [16:15.00]யவனென் வாயின் மண்ணினை யட்டி
// [16:20.00]யென்பிழைப் பொழித்த தருணாசலா(அ)
// [16:25.00]யாருமறி யாதென் மதியினை மருட்டி
// [16:30.00]யெவர்கொளை கொண்ட தருணாசலா (அ)
// [16:34.00]ரமணனென் றுரைத்தேன் ரோசங் கொளாதெனை
// [16:39.00]ரமித்திடச் செயவா வருணாசலா(அ)
// [16:44.00]ராப்பக லில்லா வெறுவெளி வீட்டில்
// [16:49.00]ரமித்திடு வோம்வா வருணாசலா(அ)
// [16:54.00]லட்சியம் வைத்தரு ளஸ்திரம் விட்டெனைப்
// [16:59.00]பட்சித்தாய் பிராணனோ டருணாசலா(அ)
// [17:04.00]லாபநீ யிகபர லாபமி லெனையுற்று
// [17:09.00]லாபமென் னுற்றனை யருணாசலா(அ)
// [17:14.00]வரும்படி சொலிலை வந்தென் படியள
// [17:18.00]வருந்திடுன் றலைவிதி யருணாசலா(அ)
// [17:24.00]வாவென் றகம்புக்குன் வாழ்வரு ளன்றேயென்
// [17:28.00]வாழ்விழந் தேனரு ளருணாசலா(அ)
// [17:34.00]விட்டிடிற் கட்டமாம் விட்டிடா துனையுயிர்
// [17:38.00]விட்டிட வருள்புரி யருணாசலா(அ)
// [17:43.00]வீடுவிட் டீர்த்துள வீடுபுக்குப் பையவுன்
// [17:48.00]வீடுகாட் டினையரு ளருணாசலா(அ)
// [17:53.00]வெளிவிட்டே னுன்செயல் வெறுத்திடா துன்னருள்
// [17:58.00]வெளிவிட் டெனைக்கா வருணாசலா(அ)
// [18:03.00]வேதாந் தத்தே வேறற விளங்கும்
// [18:07.00]வேதப் பொருளரு ளருணாசலா(அ)
// [18:13.00]வைதலை வாழ்த்தா வைத்தருட் குடியா
// [18:17.00]வைத்தெனை விடாதரு ளருணாசலா(அ)
// [18:22.00]அம்புவி லாலிபோ லன்புரு வுனிலெனை
// [18:27.00]யன்பாக் கரைத்தரு ளருணாசலா(அ)
// [18:32.00]அருணையென் றெண்ணயா னருட்கண்ணி பட்டேனுன்
// [18:37.00]னருள்வலை தப்புமோ வருணாசலா(அ)
// [18:42.00]சிந்தித் தருட்படச் சிலந்திபோற் கட்டிச்
// [18:46.00]சிறையிட் டுண்டனை யருணாசலா(அ)
// [18:51.00]அன்பொடுன் னாமங்கே ளன்பர்த மன்பருக்
// [18:56.00]கன்பனா யிடவரு ளருணாசலா(அ)
// [19:01.00]என்போலுந் தீனரை யின்புறக் காத்துநீ
// [19:06.00]யெந்நாளும் வாழ்ந்தரு ளருணாசலா(அ)
// [19:11.00]என்புரு கன்பர்த மின்சொற்கொள் செவியுமென்
// [19:16.00]புன்மொழி கொளவரு ளருணாசலா(அ)
// [19:21.00]பொறுமையாம் பூதர புன்சொலை நன்சொலாப்
// [19:25.00]பொறுத்தரு ளிஷ்டம்பின் னருணாசலா(அ)
// [19:30.00]மாலை யளித்தரு ணாசல ரமணவென்
// [19:35.00]மாலை யணிந்தரு ளருணாசலா
// [19:40.00]மாலை யளித்தரு ணாசல ரமணவென்
// [19:45.00]மாலை யணிந்தரு ளருணாசலா  (அ)
// [19:51.00]அருணா சலசிவ அருணா சலசிவ
// [20:11.00]அருணா சலசிவ அருணாசலா!
// [20:11.00]அருணா சலசிவ அருணா சலசிவ
// [20:11.00]அருணா சலசிவ அருணாசலா!
// [20:11.00]அருணா சலம்வாழி யன்பர் களும்வாழி
// [20:11.00]அக்ஷர மணமாலை வாழி.
// """,
//   """[00:00.00]அருணாசல மஹாத்மியம்
// [00:00.05]கருணார் ணவமாய்க் கருதக் கதிநல்கும்
// [00:07.00]அருணாசல சிவமீதாம்
// [00:12.50]
// [00:13.00]புத்தியகங் காரம் புலம்பெய்த வோங்கு
// [00:20.00]மத்தியித யந்தான் மறையவனு மாலு
// [00:25.00]நத்தவறி யாது நலங்குலைய வன்னார்
// [00:31.00]மத்தியொளி ரண்ணா மலையினது மெய்யே.
// [00:36.50]
// [00:36.50]இத்தனுவே நானா மெனுமதியை நீத்தப்
// [00:43.30]புத்தியித யத்தே பொருந்தியக நோக்கா
// [00:49.00]லத்துவித மாமெய் யகச்சுடர்காண் கைபூ
// [00:54.80]மத்தியெனு மண்ணா மலைச்சுடர்காண் மெய்யே.
// [01:00.50]
// [01:01.00]அதுவேதல மருணாசலந் தலம்யாவிலு மதிக
// [01:03:00]மதுபூமியி னிதயம்மறி யதுவேசிவ னிதயப்
// [01:12:00]பதியாமொரு மருமத்தலம் பதியாமவ னதிலே
// [01:21:00]வதிவானொளி மலையாநித மருணாசல மெனவே.
// [01:39.70]
// [01:39.70]ஆதியரு ணாசலப்பே ரற்புதலிங் கத்துருக்கொ
// [01:47.00]ளாதிநாண் மார்கழியி லாதிரையச் சோதியெழு
// [01:54.00]மீசனைமான் முன்னமர ரேத்திவழி பட்டநாண்
// [02:00.00]மாசிசிவ ராத்திரியா மற்று.
// [02:05.50](3)
// [02:06.00]அங்கியுரு வாயுமொளி மங்குகிரி யாகத்
// [02:11.00]தங்கலரு ளாலுலகந் தாங்குவதற் கன்றி
// [02:18.00]யிங்குறைவன் சித்தனென வென்றுமென துள்ளே
// [02:23.00]பொங்கியொளி ருங்குகைபல் போகமொடென் றுள்ளே.
// [02:30.10](4)
// [02:31.00]எல்லா வுலகுந் தகையவ் வியலாற்
// [02:36.00]பொல்லா வினைகள் ருணமாம் புகலீ
// [02:42.70]தில்லா ததுவா மெதுகண் ணுறலா
// [02:46.80]லெல்லா ரருணா சலமா மிதுவே.
// [02:53.50](5)
// [02:54.00]உருத்தெரி யெல்லை யுற்றுகண் ணுற்றாற்
// [02:59.00]கருத்தினாற் றூரக் கருதினா லும்மே
// [03:04.00]வருத்த முறாது வராதவே தாந்த
// [03:09.50]வருத்தவிஞ் ஞான மார்க்குமுண் டாமே.
// [03:15.50](6)
// [03:16.00]யோசனை மூன்றா மித்தல வாசர்க்
// [03:21.00]காசறு தீக்கை யாதியின் றியுமென்
// [03:26.00]பாசமில் சாயுச் சியம்பயக் கும்மே
// [03:31.00]யீசனா மென்ற னாணையி னானே.
// [03:36.50](7)
// [03:37.00]என்றுமே யறவோ ரன்பர்க் கிருப்பிட மித்த லந்தான்
// [03:44.00]பொன்றுவார் பிறர்க்கின் னாவுன் புன்மையர் பன்னோய் துன்னி
// [03:51.30]யொன்றுறா தொழியுந் தீயோ ருரனொரு கணத்திங் கங்கிக்
// [03:58.00]குன்றுரு வருணை யீசன் கோபவெந் தழல்வி ழாதே.
// [04:07.50]

// """
// ];

final transLyric = """[ti:Arunachala Mahatmiyam]""";

final tamil_mp3_parent_url =
    "https://www.sriramana.org/music/7daytamilparayana/";
final mp3_tamil_list = [
  "11arunachala_mahatmiyam.mp3",
  "12arunachala_aksharamanamalai.mp3",
  "13arunachala_navamanimalai.mp3",
  "14arunachala_pathigam.mp3",
  "15arunachala_ashtakam.mp3",
  "16arunachala_pancharatnam.mp3",
  "17arunachala_ramanan.mp3",
  "18vazhthu.mp3", // 8
  "21upadesa_undiyar.mp3",
  "22ulladhu_narpadhu.mp3",
  "23ulladhu_narpadhu_anubandham.mp3",
  "24arunachala_pancharatnam.mp3",
  "25sri_arunachala_ramana.mp3",
  "26vazhthu.mp3", // 14
  "31eganma_panchakam.mp3",
  "32appalappattu.mp3",
  "33anma_vidya_keerthanam.mp3",
  "34devikalothram.mp3",
  "35arunachala_pancharatnam.mp3",
  "36arunachala_ramanan.mp3",
  "37vazhthu.mp3", // 21
  "41athma_sakshatkaraprakaranam.mp3",
  "42bhagavath_geetha_saram.mp3",
  "43arunachala_pancharatnam.mp3",
  "44arunachala_ramanan.mp3",
  "45vazhthu.mp3", // 26
  "51sri_dakshinamoorthy_thothiram.mp3",
  "52anma_bodham.mp3",
  "53gurusthuthi.mp3",
  "54aththamalagam.mp3",
  "55arubachala_pancharathnam.mp3",
  "56arunachala_ramanan.mp3",
  "57vazhthu.mp3", // 33
  "61kalai_pattu.mp3",
  "62gummi_pattu.mp3",
  "63ponnolir_pathu.mp3",
  "64ponnaiyoththa_pattu.mp3",
  "65sri_ramana_sathguru.mp3",
  "001_vazhga_swayam_prakasam.mp3", //39
  "004_punarvasu_vannam.mp3",
  "005_vendar_pathigam.mp3"
];

final tamil_daystext_list = [
  "திங்கட்கிழமை பாடல்கள்", //Monday songs
  "செவ்வாய்க்கிழமை பாடல்கள்", //Tuesday songs
  "புதன்கிழமை பாடல்கள்", //Wednesday songs
  "வியாழக்கிழமை பாடல்கள்", //Thursday songs
  "வெள்ளிக்கிழமை பாடல்கள்", //Friday songs
  "சனிக்கிழமை பாடல்கள்", //Saturday songs
  "பிற பாடல்கள்", //other songs
];

final tamil_days_names = [
  "திங்கட்கிழமை", //Monday
  "செவ்வாய்க்கிழமை", //Tuesday
  "புதன்கிழமை", //Wednesday
  "வியாழக்கிழமை", //Thursday
  "வெள்ளிக்கிழமை", //Friday
  "சனிக்கிழமை", //Saturday
];

final tamil_songs_list = [
  [
    "1. அருணாசல மாகாத்மியம்",
    "2. அருணாசல அக்ஷரமணமாலை",
    "3. அருணாசல நவமணிமாலை",
    "4. அருணாசல பதிகம்",
    "5. அருணாசல அஷ்டகம்",
    "6. அருணாசல பஞ்சரத்னம்",
    "7. அருணாசல ரமணன்",
    "8. வாழ்த்து"
  ],
  [
    "1. உபதேசவுந்தியார்",
    "2. உள்ளது நாற்பது",
    "3. உள்ளது நாற்பது அனுபந்தம்",
    "4. அருணாசல பஞ்சரத்னம்",
    "5. அருணாசல ரமணன்",
    "6. வாழ்த்து"
  ],
  [
    "1. ஏகான்ம விவேகம்",
    "2. அப்பளப்பாட்டு",
    "3. ஆன்மவித்தை",
    "4. தேவிகாலோத்ரம்",
    "5. அருணாசல பஞ்சரத்னம்",
    "6. அருணாசல ரமணன்",
    "7. வாழ்த்து"
  ],
  [
    "1. ஆன்ம சாட்சாத்காரம் பிரகரணம்",
    "2. பகவத் கீதா சாரம்",
    "3. அருணாசல பஞ்சரத்னம்",
    "4. அருணாசல ரமணன்",
    "5. வாழ்த்து"
  ],
  [
    "1. தக்ஷிணாமூர்த்தி தோத்திரம்",
    "2. ஆன்மபோதம்",
    "3. குருஸ்துதி",
    "4. அத்தாமலகம்",
    "5. அருணாசல பஞ்சரத்னம்",
    "6. அருணாசல ரமணன்",
    "7. வாழ்த்து"
  ],
  [
    "1. காலைப்பாட்டு",
    "2. கும்மிப்பாட்டு",
    "3. பொன்னொளிர் பத்து",
    "4. பொன்னையொத்த பத்து",
    "5. ரமணஸத்குரு"
  ],
  ["வாழ்க ஸ்வயம் ப்ரகாசம்", "புனர்வசு வண்ணம்", "வேண்டற் பதிகம்"]
];

var songIndex = [
  [0, 1, 2, 3, 4, 5, 6, 7],
  [8, 9, 10, 11, 12, 13],
  [14, 15, 16, 17, 18, 19, 20],
  [21, 22, 23, 24, 25],
  [26, 27, 28, 29, 20, 31, 32],
  [33, 34, 35, 36, 37],
];